tests/fixtures/artifact-replay/mpi-success/case/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.0206  0        -0.0005)  // 0
    (-0.0206  0.0254   -0.0005)  // 1
    ( 0       -0.0254  -0.0005)  // 2
    ( 0        0        -0.0005)  // 3
    ( 0        0.0254   -0.0005)  // 4
    ( 0.206   -0.0254   -0.0005)  // 5
    ( 0.206    0        -0.0005)  // 6
    ( 0.206    0.0254   -0.0005)  // 7
    ( 0.290   -0.0166   -0.0005)  // 8
    ( 0.290    0        -0.0005)  // 9
    ( 0.290    0.0166   -0.0005)  // 10

    (-0.0206  0         0.0005)  // 11
    (-0.0206  0.0254    0.0005)  // 12
    ( 0       -0.0254   0.0005)  // 13
    ( 0        0         0.0005)  // 14
    ( 0        0.0254    0.0005)  // 15
    ( 0.206   -0.0254    0.0005)  // 16
    ( 0.206    0         0.0005)  // 17
    ( 0.206    0.0254    0.0005)  // 18
    ( 0.290   -0.0166    0.0005)  // 19
    ( 0.290    0         0.0005)  // 20
    ( 0.290    0.0166    0.0005)  // 21
);

blocks
(
    hex (0 3 4 1 11 14 15 12) (18 30 1) simpleGrading (0.2 0.5 1)
    hex (2 5 6 3 13 16 17 14) (180 27 1) simpleGrading (5 2 1)
    hex (3 6 7 4 14 17 18 15) (180 30 1) simpleGrading (5 0.5 1)
    hex (5 8 9 6 16 19 20 17) (25 27 1) simpleGrading (1 2 1)
    hex (6 9 10 7 17 20 21 18) (25 30 1) simpleGrading (1 0.5 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 11 12 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 9 20 19)
            (9 10 21 20)
        );
    }

    upperWall
    {
        type wall;
        faces
        (
            (1 12 15 4)
            (4 15 18 7)
            (7 18 21 10)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 3 14 11)
            (2 13 14 3)
            (2 5 16 13)
            (5 8 19 16)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (2 3 6 5)
            (3 4 7 6)
            (5 6 9 8)
            (6 7 10 9)

            (11 14 15 12)
            (13 16 17 14)
            (14 17 18 15)
            (16 19 20 17)
            (17 20 21 18)
        );
    }
);

mergePatchPairs
(
);
