tests/fixtures/artifact-replay/mpi-success/case/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;
method          simple;

simpleCoeffs
{
    n           (4 1 1);
    delta       0.001;
}

distributed     no;
roots           ();
