tests/fixtures/artifact-replay/mpi-success/case/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default                                 none;
    div(phi,U)                              bounded Gauss linearUpwind grad(U);
    div(phi,k)                              bounded Gauss limitedLinear 1;
    div(phi,epsilon)                        bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
